# SpotCoordinateElevationPrefix Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpotCoordinateElevationPrefix Property
ParameterTypeId Class See Also
---
"Elevation Prefix"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpotCoordinateElevationPrefix { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpotCoordinateElevationPrefix As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpotCoordinateElevationPrefix {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace